sabariyogeshs32-efe/FreeRTOS-STM32-Projects/07_CMSIS_RTOS_V2/40.Cmsis_Rtos_TerminatingThreads/Core/Src/uart.c
#include "stm32f4xx_hal.h"

UART_HandleTypeDef huart2;


#define SR_TXE	(1U<<7)
#define SR_RXNE	(1U<<5)


void USART2_UART_TX_Init(void)
{


  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {

  }


}

void USART2_UART_RX_Init(void)
{


  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {

  }


}


void uart_write(int ch)
{
	/*Wait Until the TXE Flag set */
	while(!(USART2->SR & SR_TXE)){}
	USART2->DR = (ch & 0xFF);
	//return ch;
}

char uart_read(void)
{
	/*Poll until the data received in the DR */
	while(!(USART2->SR & SR_RXNE)){}

	/*return what was read */
	return USART2->DR;

}


int __io_putchar(int ch)
{
	uart_write(ch);
	return ch;
}
